; domain
(define (domain capp)
    (:predicates (CUERPO ?x) (HERRAMIENTA ?x) 
        (ARMARIO ?x) (HUSILLO ?x) (DIRECCION ?x)
        (AGUJERO ?x) (RANURA ?x)
        (en ?x ?y) (vinculo ?x ?y))

    (:action cambio-herramienta :parameters (?h1 ?h2 ?a ?m)
        :precondition (and (HERRAMIENTA ?h1) 
        (HERRAMIENTA ?h2) (ARMARIO ?a) (HUSILLO ?m)
        (en ?h1 ?a) (en ?h2 ?m))
        :effect (and (en ?h1 ?m) (not (en ?h1 ?a)) 
        (en ?h2 ?a) (not (en ?h2 ?m))))
    
    (:action rotacion-pieza :parameters (?p ?s)
        :precondition (and (CUERPO ?p) (DIRECCION ?s) (en ?p ?s))
        :effect (and (not (en ?p ?s))))
    
    (:action agujerear :parameters (?p ?h ?m ?a)
        :precondition (and (CUERPO ?p)
        (HERRAMIENTA ?h) (AGUJERO ?a) (HUSILLO ?m) 
        (vinculo ?h ?a)
        (not (en ?p ?a)) (en ?h ?m))
        :effect (and (en ?p ?a))
    )

    (:action fresar :parameters (?p ?h ?m ?r)
        :precondition (and (CUERPO ?p)
        (HERRAMIENTA ?h) (RANURA ?r) (HUSILLO ?m) 
        (vinculo ?h ?r)
        (not (en ?p ?r)) (en ?h ?m))
        :effect (and (en ?p ?r))
    )
)

; problem
(define (problem capp) 

    (:domain capp)

    (:objects p b1 b2 b3 f1 f2 f3
        h1 h2 h3 r1 r2 r3 a m)

    (:init (CUERPO p) 
        (HERRAMIENTA b1) (HERRAMIENTA b2) (HERRAMIENTA b3)
        (HERRAMIENTA f1) (HERRAMIENTA f2) (HERRAMIENTA f3)
        (ARMARIO a) (HUSILLO m)
        (AGUJERO h1) (AGUJERO h2) (AGUJERO h3)
        (RANURA r1) (RANURA r2) (RANURA r3)
        (en f1 m) (en b1 a) (en b2 a) (en b3 a) (en f2 a) (en f3 a)
        (vinculo b1 h1) (vinculo b2 h2) (vinculo b3 h3)
        (vinculo f1 r1) (vinculo f2 r2) (vinculo f3 r3)
        (not (en p h1)) (not (en p h2)) (not (en p h3))
        (not (en p r1)) (not (en p r2)) (not (en p r3))
    )

    (:goal (and
        (en p h1) (en p h2) (en p h3)
        (en p r1) (en p r2) (en p r3)
        )
    )
)

; plan
1. (fresar p f1 m r1)
   added: (en p r1)
   goals met: 1 of 6
2. (cambio-herramienta b1 f1 a m)
   deleted: (en b1 a) (en f1 m)
   added: (en b1 m) (en f1 a)
   goals met: 1 of 6
3. (agujerear p b1 m h1)
   added: (en p h1)
   goals met: 2 of 6
4. (cambio-herramienta b2 b1 a m)
   deleted: (en b2 a) (en b1 m)
   added: (en b2 m) (en b1 a)
   goals met: 2 of 6
5. (agujerear p b2 m h2)
   added: (en p h2)
   goals met: 3 of 6
6. (cambio-herramienta b3 b2 a m)
   deleted: (en b3 a) (en b2 m)
   added: (en b3 m) (en b2 a)
   goals met: 3 of 6
7. (agujerear p b3 m h3)
   added: (en p h3)
   goals met: 4 of 6
8. (cambio-herramienta f2 b3 a m)
   deleted: (en f2 a) (en b3 m)
   added: (en f2 m) (en b3 a)
   goals met: 4 of 6
9. (fresar p f2 m r2)
   added: (en p r2)
   goals met: 5 of 6
10. (cambio-herramienta f3 f2 a m)
   deleted: (en f3 a) (en f2 m)
   added: (en f3 m) (en f2 a)
   goals met: 5 of 6
11. (fresar p f3 m r3)
   added: (en p r3)
   goals met: 6 of 6
